raceTest/Setup/Deep/olaFoam/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      StokesII;

genAbs          1;

absDir          0.0;

nPaddles        1;

waveHeight      1.50;

wavePeriod      8;

waveDir         0.0;

wavePhase       1.57079633;

// Change both entries to true to re-read this dictionary upon restart.
rereadAlpha     false;
rereadU         false;

// ************************************************************************* //
